load-test/tests/test-passwordreset.yml
config:
  target: "https://stage.identity.q4inc.com"
  ensure:
    max: 10000 # fail if max response time exceeds 5000ms
    maxErrorRate: 8 # fail if error rate exceeds 0%
  phases:
    - duration: 300 # 5 min
      arrivalRate: 4 # 4 users per second ~ 200 per minute: 4, 8, 12, 20
      rampTo: 6 # range of users per second
      name: "Q4 IDP Password Reset Load Test"
  processor: "./processor/test-passwordReset.util.js"
scenarios:
  - name: "Q4 IDP Password Reset Flow"
    flow:
      - post:
          beforeRequest: "beforeForgotPassword"
          afterResponse: "afterForgotPassword"
          url: "/password/forgot-password"
      - get:
          beforeRequest: "beforeSetPassword"
          url: "/oauth/auth?client_id=q4-public-events-client&redirect_uri=https%3A%2F%2Fconnect.stage.q4inc.com%2Finternal%2Fpublic-users-testing&response_type=code&prompt=resetPassword&userCode={{ setPasswordCode }}"
      - post:
          beforeRequest: "beforeCompleteSetPassword"
          url: "/interaction/{{ interactionId }}/set-password/complete"